import ContentPlace from "../components/ContentPlace.tsx";

import skorohodPhoto from '../assets/funders/skorohod.jpg'
import lebedevPhoto from '../assets/funders/lebedev.jpg'
import bozhydarnykPhoto from '../assets/funders/bozhydarnyk.jpg'
import {useQuery} from "@tanstack/react-query";
import client from "../../contentfulClient.tsx";
import Loader from "../components/Loading.tsx";

export default  function Funders(){

    const profesors = [
        {
            img : skorohodPhoto,
            desc : 'Валерій Володимирович Скороход належить до покоління видатних вчених у галузі сучасного матеріалознавства, діяльність якого співпала зі створенням у 1955 р. і становленням Інституту проблем матеріалознавства НАН України. Розуміючи виняткову важливість знання сутності технологічних процесів порошкової металургії для розробки матеріалів сучасної техніки, В.В. Скороход присвятив свої наукові дослідження створенню фундаментальних основ цих процесів і обґрунтуванню інженерних методів керування ними. Роботи вченого в галузі теоретичного матеріалознавства і наукових основ порошкової металургії мали визначальний вплив та продовжують впливати на рівень матеріалознавчих розробок і користуються заслуженим визнанням серед матеріалознавців, а педагогічна діяльність Валерія Володимировича, безумовно, визначила високу якість матеріалознавчої освіти у вищій школі. Валерій Володимирович Скороход народився 28 липня 1934 р. у Нікополі Дніпропетровської області в інтелігентній учительській сім’ї. В 1951 р. після закінчення Ковельської середньої школи № 3 він вступив до Київського політехнічного інституту на металургійний факультет і, закінчивши його в 1956 р. ,одержав диплом з відзнакою зі спеціальності «Металознавство і термічна обробка металів». В.В. Скороход — автор більше 465 наукових праць, у тому числі 8монографій та 30 винаходів і патентів. Ще в перших його наукових працях, присвячених теоретичному дослідженню фізичних та реологічних властивостей порошкових гетерогенних матеріалів з урахуванням їх реальної структури, задачі опису та трактування цих властивостей розв’язуються на основі фундаментальних досліджень фізики металів і механіки деформування твердих тіл. З 1981 р. В.В. Скороход — дійсний член Міжнародного інституту науки про спікання при Сербській академії наук і мистецтв. У 1985 р. його обрано членом- кореспондентом Національної академії наук України із спеціальності "Матеріалознавство", у 1990 р. — її дійсним членом із спеціальності "Матеріалознавство і порошкова металургія". У 1987 р. вченому присуджено Державну премію України в галузі науки і техніки за розробку спеціальних псевдосплавів, а в 1995 р. він удостоєний почесного звання "Заслужений діяч науки і техніки України". В.В. Скороход — почесний учасник Всесвітніх конференцій круглого столу по спіканню, почесний член Сербської академії наук і мистецтв (1998 ), почесний член Польського керамічного товариства, йому присуджено Міжнародну премію ім. Я.І. Френкеля, З 1981 р. під його керівництвом функціонує міжнародний семінар "Реологические модели и процеси деформирования порошкових и композиционннх материалов", робота якого сприяла формуванню нового напрямку — механіки деформівних порошкових тіл. Універсальний вчений, талановитий організатор, В.В. Скороход заснував наукову школу, роботи якої є фундаментом сучасного розвитку різноманітних технологій. Серед його учнів більше 10 докторів і 30 кандидатів наук.'
        },
        {
            img : lebedevPhoto,
            desc: 'Творчий шлях академіка НАН України, доктора технічних наук, професора Анатолія Олексійовича Лебедєва нерозривно пов\'язаний із Інститутом проблем міцності ім. Г.С. Писаренко НАН України, де він працював головним науковим співробітником. Основними завданнями Інституту є теоретичні та експериментальні дослідження критеріїв міцності матеріалів та несучої здатності елементів конструкцій, що працюють в екстремальних умовах. А.А. Лебедєв – вчений широкого спектра наукових інтересів у галузі механіки деформованого твердого тіла та міцності конструкцій. З його ім\'ям пов\'язано формування фізично обґрунтованих концепцій рівнянь стану матеріалів різних класів з урахуванням температури, режимів навантаження, характеру трансформації структури та інших факторів. Він автор понад 550 наукових публікацій, у тому числі 22 монографій, має понад 50 винаходів. У 2001 р. йому було надано звання почесного доктора НТУУ «КПІ». Під його керівництвом підготовлено 40 кандидатів та 7 докторів наук. А.А. Лебедєв – голова Наукової ради з проблеми «Механіка твердого тіла, що деформується» при Відділенні механіки НАН України, заст. голови Національного комітету з теоретичної та прикладної механіки України, член Національного комітету з теоретичної та прикладної механіки Російської федерації, Нью-Йоркської академії наук, Європейського співтовариства цілісності конструкцій (ESIS), Американського товариства металів (ASM International), Технічного комітету Європейської асоціації з експериментальної (EURASEM), експерт INTAS, дійсний член Російської академії з проблем якості та Санкт-Петербурзької академії з проблем міцності.'
        },
        {
            img : bozhydarnykPhoto,
            desc: 'Віктор Володимирович Божидарник у 1970 році закінчив Львівський університет, де здобув вищу освіту за спеціальністю «механіка». У 1974 році він захистив дисертацію на присудження наукового ступеня кандидата фізико-математичних наук. У Луцьку розпочалася науково- педагогічна діяльність. Майбутній ректор працював на посадах: старший лаборант НДС ЛДУ ім. Франка, асистент, старший викладач, декан, виконувач обов\'язків директора загальнотехнічного факультету Луцького філіалу Львівського політехнічного інституту, директором Луцького філіалу Львівського політехнічного інституту, ректором Луцького політехнічного інституту, ректором Луцького державного технічного університету, ректором національного університету. Віктор Володимирович очолював виш із 1977 року, що є рекордом для України. Завдяки його багатогранному педагогічному й організаторському талантові Луцький національний технічний університет перетворився в один із провідних вищих технічних навчальних закладів України. Заслужений працівник народної освіти України, дійсний член Академії інженерних наук, академік Академії економічної кібернетики, член-кореспондент Академії менеджменту та підприємництва, академік Академії наук вищої школи України. За значний внесок в організацію та розвиток науки нагороджений орденом «За заслуги» III, II ступенів, присвоєно звання «Заслужений працівник народної освіти України».'
        }
    ]
    const { data, error, isLoading } = useQuery({
        queryKey: ['funders'],
        queryFn: async () => {
            const response = await client.getEntries({ content_type: "funders" });

            const assetsMap = response.includes?.Asset.reduce((acc, asset) => {
                acc[asset.sys.id] = asset.fields.file.url;
                return acc;
            }, {});

            return response.items.map((event) => ({
                name: event.fields.name,
                description: event.fields.description,
                photo: event.fields.photo?.[0]?.sys?.id ? assetsMap[event.fields.photo[0].sys.id] : null,
            }));
        },
    });


    console.log(data)

    if (isLoading) return <Loader/>;
    return <div className={'flex justify-center'}>
        <ContentPlace>
            <section className={'flex items-center text-[#212529]  flex-col mt-8'}>
                <h1 className={'text-[20px] sm:text-[30px] text-center mx-auto font-[segoeuithibd]'}>Ініціаторами проведення конференції у зазначеному
                    форматі виступили:</h1>
                <div className={'text-[18px] sm:text-[22px] mt-3 text-center mx-auto font-[500]'}>
                    {data?.map((event, index) => (
                        <span className={'flex flex-row space-x-2'} key={index}>
                    <p>{event.name}</p>{index < data.length - 1 && ", "}
                 </span>
                    ))}
                </div>
                <div>
                    {data?.map((event) => (
                        <div className={'flex sm:flex-row flex-col mt-10 items-center space-x-5'}>
                            <img className={'sm:w-[270px] sm:h-[400px] w-[200px] h-[280px]   '} src={event.photo} alt='photo'/>
                            <p className={"flex justify-between text-[15px] mt-3 sm:text-[18px] items-center w-full"}>{event.description}</p>
                        </div>
                    ))}
                </div>
            </section>
        </ContentPlace>
    </div>
}